In [25]:
# Importing libraries
import pandas as pd
import numpy as np

In [26]:
# Read csv file into a pandas dataframe
property_data="property_data.csv"
df = pd.read_csv(property_data, header = 0)

In [27]:
# Take a look at the first few rows
df.head(10)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3       1.0  1000
1  100002000.0   197.0   LEXINGTON            N            3       1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN       1.0   850
3  100004000.0   201.0    BERKELEY           12            1       NaN   700
4          NaN   203.0    BERKELEY            Y            3       2.0  1600
5  100006000.0   207.0    BERKELEY            Y          NaN       1.0   800
6  100007000.0     NaN  WASHINGTON          NaN            2       NaN   950
7  100008000.0   213.0     TREMONT            Y            1       1.0   NaN
8  100009000.0   215.0     TREMONT            Y           na       2.0  1800

In [28]:
#df.info() will give number of non-null count in variables
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PID           8 non-null      float64
 1   ST_NUM        7 non-null      float64
 2   ST_NAME       9 non-null      object
 3   OWN_OCCUPIED  8 non-null      object
 4   NUM_BEDROOMS  7 non-null      object
 5   NUM_BATH      7 non-null      float64
 6   SQ_FT         8 non-null      object
dtypes: float64(3), object(4)
memory usage: 632.0+ bytes

In [4]:
# descriptive analysis
df.describe()

                PID      ST_NUM  NUM_BATH
count  8.000000e+00    7.000000  7.000000
mean   1.000050e+08  191.428571  1.357143
std    2.927700e+03   39.080503  0.475595
min    1.000010e+08  104.000000  1.000000
25%    1.000028e+08  199.000000  1.000000
50%    1.000050e+08  203.000000  1.000000
75%    1.000072e+08  210.000000  1.750000
max    1.000090e+08  215.000000  2.000000

In [5]:
# overall any missing values or not ?
df.isnull().values.any()

True

In [6]:
# Total number of missing values
df.isnull().sum().sum()

9

In [8]:
#to check ST_NUM contains missing value or not
df['ST_NUM'].isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

In [9]:
# Making a list of missing value types
missing_values = ["n/a", "na", "--"]
df = pd.read_csv(property_data, na_values = missing_values)

In [10]:
# Take a look at the first few rows whether all missing values are correct
df.head(10)

,PID,ST_NUM,ST_NAME,OWN_OCCUPIED,NUM_BEDROOMS,NUM_BATH,SQ_FT
0,100001000.0,104.0,PUTNAM,Y,3.0,1.0,1000.0
1,100002000.0,197.0,LEXINGTON,N,3.0,1.5,NaN
2,100003000.0,NaN,LEXINGTON,N,NaN,1.0,850.0
3,100004000.0,201.0,BERKELEY,12,1.0,NaN,700.0
4,NaN,203.0,BERKELEY,Y,3.0,2.0,1600.0
5,100006000.0,207.0,BERKELEY,Y,NaN,1.0,800.0
6,100007000.0,NaN,WASHINGTON,NaN,2.0,NaN,950.0
7,100008000.0,213.0,TREMONT,Y,1.0,1.0,NaN
8,100009000.0,215.0,TREMONT,Y,NaN,2.0,1800.0

In [11]:
df['OWN_OCCUPIED'].isnull()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
Name: OWN_OCCUPIED, dtype: bool

In [12]:
# Detecting numbers and converting them to missing 
cnt=0
for row in df['OWN_OCCUPIED']:
    try:
        int(row)
        df.loc[cnt, 'OWN_OCCUPIED']=np.nan
    except ValueError:
        pass
    cnt+=1

In [13]:
#Now Check
df['OWN_OCCUPIED']

0      Y
1      N
2      N
3    NaN
4      Y
5      Y
6    NaN
7      Y
8      Y
Name: OWN_OCCUPIED, dtype: object

In [14]:
# Replace missing values with a number
df['OWN_OCCUPIED'].fillna('Y', inplace=True)

In [16]:
#Now Check
df['OWN_OCCUPIED']

0    Y
1    N
2    N
3    Y
4    Y
5    Y
6    Y
7    Y
8    Y
Name: OWN_OCCUPIED, dtype: object

In [17]:
df['ST_NUM']

0    104.0
1    197.0
2      NaN
3    201.0
4    203.0
5    207.0
6      NaN
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

In [18]:
# Replace missing values with a number
df['ST_NUM'].fillna(125, inplace=True)

In [19]:
df['ST_NUM']

0    104.0
1    197.0
2    125.0
3    201.0
4    203.0
5    207.0
6    125.0
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

In [20]:
# Location based replacement
df.loc[2,'ST_NUM'] = 165

In [21]:
df['ST_NUM']

0    104.0
1    197.0
2    165.0
3    201.0
4    203.0
5    207.0
6    125.0
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

In [22]:
df['NUM_BEDROOMS']

0    3.0
1    3.0
2    NaN
3    1.0
4    3.0
5    NaN
6    2.0
7    1.0
8    NaN
Name: NUM_BEDROOMS, dtype: float64

In [23]:
# Replace using median 
median = df['NUM_BEDROOMS'].median()
df['NUM_BEDROOMS'].fillna(median, inplace=True)

In [24]:
df['NUM_BEDROOMS']

0    3.0
1    3.0
2    2.5
3    1.0
4    3.0
5    2.5
6    2.0
7    1.0
8    2.5
Name: NUM_BEDROOMS, dtype: float64